Repository: yben27/emacslispref
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: lispref/numbers.texi:857 @code{ash} gives the same results as @code{lsh} except when @var{integer1} and @var{count} are both negative. In that case, @code{ash} puts ones in the empty bit positions on the left, while @code{lsh} puts zeros in those bit positions.
fr_fr: @code{ash} donne les mêmes résultats que @code{lsh} excepté quand @var{integer1} et @var{count} sont tous les deux négatifs. Dans ce cas, @code{ash} met des 1 dans les positions de bit vide du côté gauche, alors que @code{lsh} met des 0 dans ces positions de bit.

source: lispref/numbers.texi:860 Thus, with @code{ash}, shifting the pattern of bits one place to the right looks like this:
fr_fr: Ainsi, @code{ash}, décalant la combinaison de chiffres binaires d'une place vers la droite ressemble à ceci:

source: lispref/numbers.texi:868 (ash -6 -1) @result{} -3 ;; @r{Decimal @minus{}6 becomes decimal @minus{}3.} 1 1111 1111 1111 1111 1111 1111 1010 @result{} 1 1111 1111 1111 1111 1111 1111 1101
fr_fr: (ash -6 -1) @result{} -3 ;; @r{La décimale @minus{}6 devient la décimale @minus{}3.} 1 1111 1111 1111 1111 1111 1111 1010 @result{} 1 1111 1111 1111 1111 1111 1111 1101

source: lispref/numbers.texi:873 In contrast, shifting the pattern of bits one place to the right with @code{lsh} looks like this:
fr_fr: En revanche, décaler la combinaison de chiffres binaires d'une place vers la droite avec @code{lsh} ressemble à ceci:

source: lispref/numbers.texi:881 (lsh -6 -1) @result{} 268435453 ;; @r{Decimal @minus{}6 becomes decimal 268,435,453.} 1 1111 1111 1111 1111 1111 1111 1010 @result{} 0 1111 1111 1111 1111 1111 1111 1101
fr_fr: (lsh -6 -1) @result{} 268435453 ;; @r{La décimale @minus{}6 devient la décimale 268 435 453.} 1 1111 1111 1111 1111 1111 1111 1010 @result{} 0 1111 1111 1111 1111 1111 1111 1101

source: lispref/numbers.texi:894 (lsh 5 2) ; 5 = @r{0 0000 0000 0000 0000 0000 0000 0101} @result{} 20 ; = @r{0 0000 0000 0000 0000 0000 0001 0100}
fr_fr: (lsh 5 2) ; 5 = @r{0 0000 0000 0000 0000 0000 0000 0101} @result{} 20 ; = @r{0 0000 0000 0000 0000 0000 0001 0100}

source: lispref/numbers.texi:90 #b101100 @result{} 44 #o54 @result{} 44 #x2c @result{} 44 #24r1k @result{} 44
fr_fr: #b101100 @result{} 44 #o54 @result{} 44 #x2c @result{} 44 #24r1k @result{} 44

source: lispref/numbers.texi:902 (ash 5 2) @result{} 20 (lsh -5 2) ; -5 = @r{1 1111 1111 1111 1111 1111 1111 1011} @result{} -20 ; = @r{1 1111 1111 1111 1111 1111 1110 1100} (ash -5 2) @result{} -20
fr_fr: (ash 5 2) @result{} 20 (lsh -5 2) ; -5 = @r{1 1111 1111 1111 1111 1111 1111 1011} @result{} -20 ; = @r{1 1111 1111 1111 1111 1111 1110 1100} (ash -5 2) @result{} -20

source: lispref/numbers.texi:906 (lsh 5 -2) ; 5 = @r{0 0000 0000 0000 0000 0000 0000 0101} @result{} 1 ; = @r{0 0000 0000 0000 0000 0000 0000 0001}
fr_fr: (lsh 5 -2) ; 5 = @r{0 0000 0000 0000 0000 0000 0000 0101} @result{} 1 ; = @r{0 0000 0000 0000 0000 0000 0000 0001}

source: lispref/numbers.texi:910 (ash 5 -2) @result{} 1
fr_fr: (ash 5 -2) @result{} 1

source: lispref/numbers.texi:914 (lsh -5 -2) ; -5 = @r{1 1111 1111 1111 1111 1111 1111 1011} @result{} 134217726 ; = @r{0 0111 1111 1111 1111 1111 1111 1110}
fr_fr: (lsh -5 -2) ; -5 = @r{1 1111 1111 1111 1111 1111 1111 1011} @result{} 134217726 ; = @r{0 0111 1111 1111 1111 1111 1111 1110}

source: lispref/numbers.texi:918 (ash -5 -2) ; -5 = @r{1 1111 1111 1111 1111 1111 1111 1011} @result{} -2 ; = @r{1 1111 1111 1111 1111 1111 1111 1110}
fr_fr: (ash -5 -2) ; -5 = @r{1 1111 1111 1111 1111 1111 1111 1011} @result{} -2 ; = @r{1 1111 1111 1111 1111 1111 1111 1110}

source: lispref/numbers.texi:927 This function returns the ``logical and'' of the arguments: the @var{n}th bit is set in the result if, and only if, the @var{n}th bit is set in all the arguments. (``Set'' means that the value of the bit is 1 rather than 0.)
fr_fr: Cette fonction renvoie le ``et logique'' des arguments: le @var{n}th bit est placé dans le résultat si, et seulement si, le @var{n}th bit est placer dans tous arguments. (``Placer'' veut dire que la valeur du bit est 1 plutôt que 0.)

source: lispref/numbers.texi:934 For example, using 4-bit binary numbers, the ``logical and'' of 13 and 12 is 12: 1101 combined with 1100 produces 1100. In both the binary numbers, the leftmost two bits are set (i.e., they are 1's), so the leftmost two bits of the returned value are set. However, for the rightmost two bits, each is zero in at least one of the arguments, so the rightmost two bits of the returned value are 0's.
fr_fr: Par exemple, en utilisant des nombres binaires de 4 bits, le ``et logique'' de 13 et 12 est 12: 1101 combiné avec 1100 produit 1100. Dans les deux nombres binaires, les deux bits à l'extrême gauche sont placés (c.-à-d., ils sont à 1), ainsi les deux bits à l'extrême gauche de la valeur retournée sont placés. Cependant, pour les deux bits à l'extrême droite, chacun est à zéro dans au moins un des arguments, ainsi les deux bits à l'extrême droite de la valeur retournée sont 0.

source: lispref/numbers.texi:942 (logand 13 12) @result{} 12
fr_fr: (logand 13 12) @result{} 12

source: lispref/numbers.texi:949 If @code{logand} is not passed any argument, it returns a value of @minus{}1. This number is an identity element for @code{logand} because its binary representation consists entirely of ones. If @code{logand} is passed just one argument, it returns that argument.
fr_fr: Si @code{logand} est passé sans argument, il renvoie une valeur @minus{}1. Ce nombre est un élément d'identité pour @code{logand} parce que sa représentation binaire consiste entièrement de 1. Si @code{logand} est passé à juste un argument, il renvoie cet argument.

source: lispref/numbers.texi:95 To understand how various functions work on integers, especially the bitwise operators (@pxref{Bitwise Operations}), it is often helpful to view the numbers in their binary form.
fr_fr: Pour comprendre comment les diverses fonctions travaillent sur des nombres entiers, particulièrement au niveau du bit des opérateurs (@pxref{Opérations de bits}), il est souvent utile de regarder les nombres sous leur forme binaire.

source: lispref/numbers.texi:957 (logand 14 13) ; 14 = @r{0 0000 0000 0000 0000 0000 0000 1110} ; 13 = @r{0 0000 0000 0000 0000 0000 0000 1101} @result{} 12 ; 12 = @r{0 0000 0000 0000 0000 0000 0000 1100}
fr_fr: (logand 14 13) ; 14 = @r{0 0000 0000 0000 0000 0000 0000 1110} ; 13 = @r{0 0000 0000 0000 0000 0000 0000 1101} @result{} 12 ; 12 = @r{0 0000 0000 0000 0000 0000 0000 1100}

source: lispref/numbers.texi:964 (logand 14 13 4) ; 14 = @r{0 0000 0000 0000 0000 0000 0000 1110} ; 13 = @r{0 0000 0000 0000 0000 0000 0000 1101} ; 4 = @r{0 0000 0000 0000 0000 0000 0000 0100} @result{} 4 ; 4 = @r{0 0000 0000 0000 0000 0000 0000 0100}
fr_fr: (logand 14 13 4) ; 14 = @r{0 0000 0000 0000 0000 0000 0000 1110} ; 13 = @r{0 0000 0000 0000 0000 0000 0000 1101} ; 4 = @r{0 0000 0000 0000 0000 0000 0000 0100} @result{} 4 ; 4 = @r{0 0000 0000 0000 0000 0000 0000 0100}

source: lispref/numbers.texi:969 (logand) @result{} -1 ; -1 = @r{1 1111 1111 1111 1111 1111 1111 1111}
fr_fr: (logand) @result{} -1 ; -1 = @r{1 1111 1111 1111 1111 1111 1111 1111}

source: lispref/numbers.texi:979 This function returns the ``inclusive or'' of its arguments: the @var{n}th bit is set in the result if, and only if, the @var{n}th bit is set in at least one of the arguments. If there are no arguments, the result is zero, which is an identity element for this operation. If @code{logior} is passed just one argument, it returns that argument.
fr_fr: Cette fonction renvoie le ``ou inclus'' de ses arguments: le @var{n}ième bit est placé dans le résultat si, et seulement si, le @var{n}ième bit est placé dans au moins un des arguments. S'il n'y a aucun argument, le résultat est 0, ce qui est un élément d'identité pour cette opération. Si @code{logior} est passé à juste un argument, il renvoie cet argument.

source: lispref/numbers.texi:987 (logior 12 5) ; 12 = @r{0 0000 0000 0000 0000 0000 0000 1100} ; 5 = @r{0 0000 0000 0000 0000 0000 0000 0101} @result{} 13 ; 13 = @r{0 0000 0000 0000 0000 0000 0000 1101}
fr_fr: (logior 12 5) ; 12 = @r{0 0000 0000 0000 0000 0000 0000 1100} ; 5 = @r{0 0000 0000 0000 0000 0000 0000 0101} @result{} 13 ; 13 = @r{0 0000 0000 0000 0000 0000 0000 1101}

source: lispref/numbers.texi:994 (logior 12 5 7) ; 12 = @r{0 0000 0000 0000 0000 0000 0000 1100} ; 5 = @r{0 0000 0000 0000 0000 0000 0000 0101} ; 7 = @r{0 0000 0000 0000 0000 0000 0000 0111} @result{} 15 ; 15 = @r{0 0000 0000 0000 0000 0000 0000 1111}
fr_fr: (logior 12 5 7) ; 12 = @r{0 0000 0000 0000 0000 0000 0000 1100} ; 5 = @r{0 0000 0000 0000 0000 0000 0000 0101} ; 7 = @r{0 0000 0000 0000 0000 0000 0000 0111} @result{} 15 ; 15 = @r{0 0000 0000 0000 0000 0000 0000 1111}

source: lispref/objects.texi:17 A Lisp @dfn{object} is a piece of data used and manipulated by Lisp programs. For our purposes, a @dfn{type} or @dfn{data type} is a set of possible objects.
fr_fr: Un @dfn{object} List est un morceau de données employées et manipulées par les programmes Lisp. Pour nous, un @dfn{type} ou un @dfn{data type} est un ensemble d'objets possibles.

source: lispref/symbols.texi:17 A @dfn{symbol} is an object with a unique name. This chapter describes symbols, their components, their property lists, and how they are created and interned. Separate chapters describe the use of symbols as variables and as function names; see @ref{Variables}, and @ref{Functions}. For the precise read syntax for symbols, see @ref{Symbol Type}.
fr_fr: Un @dfn{symbole} est un objet avec un nom unique. Ce chapitre décrit les symboles, leurs composants, leurs listes de propriétés et comment ils sont créés et conservés. L'utilisation de symboles comme noms de variables ou de fonctions est décrit dans d'autres chapitres ; consultez @ref{Variables} et @ref{Functions}. Pour la syntaxe exacte des symboles, consultez @ref{Le type symbole}.

source: lispref/symbols.texi:20 You can test whether an arbitrary Lisp object is a symbol with @code{symbolp}:
fr_fr: Vous pouvez tester si n'importe quel objet Lisp est un symbole avec @code{symbolp} :

source: lispref/symbols.texi:24 This function returns @code{t} if @var{object} is a symbol, @code{nil} otherwise.
fr_fr: Cette fonction renvoie @code{t} si l'@var{objet} est un symbole et autrement @code{nil}.

source: lispref/symbols.texi:268 This function returns the string that is @var{symbol}'s name. For example:
fr_fr: Cette fonction renvoie la chaîne correspondant au nom du symbole. Par exemple :

source: lispref/symbols.texi:273 (symbol-name 'foo) @result{} "foo"
fr_fr: (symbol-name 'toto) @result{} "toto"

source: lookup tables
fr_fr: tables de recherche

source: lower case
fr_fr: Minuscule

source: make-string count character
fr_fr: make-string n caractere

source: make-symbol name
fr_fr: make-symbol nom

source: minibuffer-message string
fr_fr: minibuffer-message chaîne

source: modulus
fr_fr: modulo

source: natural numbers
fr_fr: nombres naturels

source: nil and t
fr_fr: nil et t

source: numbers
fr_fr: nombres

source: overflow
fr_fr: débordement

source: padding
fr_fr: bourrage

source: precision in format specifications
fr_fr: Des précisions dans les spécifications de format

source: predicates for numbers
fr_fr: attributs des nombres

source: print name cell
fr_fr: cellule de nom d'affichage

source: property list cell
fr_fr: cellule de liste de propriétés

source: put symbol property value
fr_fr: put symbole propriété valeur

source: reading symbols
fr_fr: Lecture de symboles

source: sequence
fr_fr: Les suites

source: split-string string &optional separators omit-nulls
fr_fr: split-string string &optionnel separators omit-nulls

source: string &rest characters
fr_fr: string &rest caracteres

source: string equality
fr_fr: Egalité de chaîne

source: string to character
fr_fr: De chaîne à caractère

source: string to number
fr_fr: De chaîne à nombre

source: string-or-null-p object
fr_fr: string-or-null-p objet

source: stringp object
fr_fr: stringp objet

source: strings
fr_fr: Chaînes de caractères

source: strings, formatting them
fr_fr: Les chaînes et leur formatage

source: substring string start &optional end
fr_fr: substring string debut &fin optionnelle

source: substring-no-properties string &optional start end
fr_fr: substring-no-properties string &optionnel fin debut

source: symbol
fr_fr: symbole

source: symbol components
fr_fr: composants des symboles

source: symbol-name symbol
fr_fr: symbol-name symbole

source: symbol-plist symbol
fr_fr: symbol-plist symbole

source: symbolp object
fr_fr: symbolp objet

source: that can be invoked from other functions.
fr_fr: qui peut être appelée depuis d'autres fonctions.

source: to
fr_fr: à

source: to the power @var{arg}.
fr_fr: à la puissance @var{arg}.

source: true
fr_fr: vrai

source: truth value
fr_fr: valeur de vérité

source: two's complement
fr_fr: complément à deux

source: upper case
fr_fr: Majuscule

source: value cell
fr_fr: cellule de valeur

source: vector (type)
fr_fr: Le type vector

source: which becomes the following when left shifted:
fr_fr: ce qui devient, lorsqu'on décale à gauche:

source: with-syntax-table @var{table} @var{body}@dots{}
fr_fr: with-syntax-table @var{table} @var{corps}@dots{}
